{
    "updated":{"version": 39, "title": "Your app has been updated to the newest version!", "content":"This update includes various bug fixes, and an update to the Joe and Charlie tapes. They are now self hosted, so they should not go down in the future.\n\nFixes include:\n-Various bug fixes, including the bug on android devices where the audio continued after clearing the app from recents.\n-Other updates and more literature is in the works.\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the homescreen. Hosting audio can get expensive! I am currently working on many upgrades and your support allows me to dedicate the time needed!\n\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 36, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update includes bug fixes. \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 20,"title":"Notification","content":"All,\nAudio has been fixed on previously affected Android devices. If it still isn't working go to the app store and search for Everything AA, and then click update.\n\nIf anyone comes across any bugs, please reach out using the Contact Us tab availible on the home screen. Have a great sober day!\n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
