{
    "updated":{"version": 36, "title": "Your app has been updated to the newest version!", "content":"This update includes a brand new shareable(with your sponsor or anyone else) nightly/daily inventory! I'm excited to bring you this feature and a lot of hard work went into it. If you run into any issues with it please reach out to me and let me know.\n\nFixes include:\n-Various bug fixes, including the ios date picker.\n-Other updates and more literature is in the works.\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the homescreen. I am currently working on the following upgrades, and your support allows me to dedicate the time needed!\n\n-Big book search and possibly notes or highlight abilities\n-Ability to add favorites with the meeting list\n-And more!\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 36, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update includes bug fixes and a brand new nightly inventory feature! \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 18,"title":"Notification","content":"All,\nThe online meeting finder we use through aa-intergroup.org appears to be temporarily down. I have alerted them to this problem and it should hopefully be fixed shortly. Unfortunately they are a separate organization so I can not assist with the issue, and don't have further details. I apologize for the inconvenience.\n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
