{
    "updated":{"version": 30, "title": "Your app has been updated to the newest version!", "content":"This update is an emergency fix for the daily reflections, GSO changed the page which broke the feature. I was able to immediately submit a fix to the app store for approval. Please consider becoming a supporter by clicking the support us button at the bottom of the home screen. Your support allows me to dedicate the substantial amount of time needed to maintain and update the app. You can also support the app by leaving a review in the app store. Have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 26, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status.\n\nThis updated includes an emergency patch for the audio section not working.\n\nIt should only take a few seconds, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 5,"title":"Notification","content":"All, \n GSO changed the formatting on the daily reflection, which currently has it temporarily not working. As usual I am getting a substantial amount of emails on the issue, thanks for giving me the heads up. I should have a fix out asap. Please consider becoming a supporter, by clicking the support us button at the bottom of the homepage. Your support means I am able to drop everything and fix any issues that pop up immediately. It also means I am able to provide upgrades and updates to the app. Thank you for your patience and support.\n-Ben S","appleLink":"","androidLink":"", "dontDisplay": false}
}
