{
    "updated":{"version": 31, "title": "Your app has been updated to the newest version!", "content":"This update is an emergency fix (the second one in 2 days) for the daily reflections, GSO changed the page which broke the feature. Thanks for your patience! The previous update did not fix the issue for all users and was unreliable. \n\nI was able to completely re-design the daily reflections page today. You will notice an update of the UI.\n\nI am able to spend time doing this because of the amazing people who are supporters of the app. If you are a supporter, thank you. If not, you can always leave a review in the app store or click on the support us tab on the home screen to become a supporter yourself. Have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 29, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update' This update includes the second fix for the daily reflections which was broken because of an update on the official website. The previous update did not fix it for everyone. \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 7,"title":"Notification","content":"All,\nThe updates for the daily reflection have been submitted to the app store and are pending approval. It is possible to see the message after the newest update, but you can easily tell if it is up to date by looking at the daily reflection. I completely redesigned it, and you will know the difference. I apologize for the inconvenience. To all the supporters of the app, I greatly appreciate you! \n-Ben S","appleLink":"","androidLink":"", "dontDisplay": false}
}
