{
    "updated":{"version": 45, "title": "Your app has been updated to the newest version!", "content":"❗New updates❗Jam packed with updates! A gratitude list feature has been added. Dark mode is now availible in the custom Big Book reader (non pdf files). ALL of the pamphlets are now available and searchable. 15 second skips are now availible in audio. Various bug fixes and performance upgrades.\n\n-Other updates are in the works!\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the homescreen. I am currently working on many upgrades and your support allows me to dedicate the time needed!\n\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 45, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update has new features and important bug fixes. \n\n If you haven't already, please consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature 😊", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 22,"title":"Notification","content":"All,\nThe meeting finder is temporarily down. I have reached out to the online-intergroup who manages the meeting finder, and they are actively trying to remedy the problem. It should not be too long before it is fixed.\n\nI would still check, as I may not have removed this message prior to it going back up. Although the meeting finder has not gone down in a while, I will be looking at options to ensure the app always has meetings available, whether that means implementing my own solution or helping the online intergroup to ensure their's never goes down again.\n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
