{
    "updated":{"version": 32, "title": "Your app has been updated to the newest version!", "content":"Fixes include:\n-Bug Fixes\n-Daily Reflection paragraph placement fix\n-Grammar and spelling fixes\n-Various other housekeeping\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the homescreen. I am currently working on the following upgrades, and your support allows me to dedicate the time needed!\n\n-Shareable nightly inventory\n-Big book search and possibly notes or highlight abilities\n-Ability to add favorites with the meeting list\n-And more!\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 32, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update includes various needed maintenance. \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 9,"title":"Notification","content":"All,\nSorry about the mismatched text in the daily reflection today. That is due to the parser I wrote misinterpreting where everything should go. It's all there, it just looks weird. I have to do all things while not violating AA's copyright which makes things more difficult than they could be. This week I've spent everyday going over the app. The next update should have some other fixes here and there, but I'm starting to work on features that people have been requesting. As well as putting in failsafes for things like the daily reflection and the meeting finder (both went down this week, and both reasons were due to outside things I don't control, talk about a stressful couple of days). As always I appreciate the supporters of the app, and I hope everyone has a great sober day. \n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
