{
    "updated":{"version": 50, "title": "Your app has been updated to the newest version!", "content":"Emergency fix for devices having connectivity issues when trying to get the daily reflections and literature. Spemt about 24 hours straight trying to make the second attempt work! Hope it works for the users still experiencing issues!\n\n-Other updates are in the works, including a dictionary and highlighting/notes.\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the home screen. I am currently working on many upgrades and your support allows me to dedicate the time needed!\n\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober holiday season!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 50, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update has an emergency fix (2nd attempt) for users encountering connectivity issues with the daily reflections and literature. Let me know if you are atill having the issue after seing this update message! \n\n If you haven't already, please consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature 😊", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 23,"title":"Notification","content":"All,\nA small amount of users are still having connectivity issues. If you are having issues with the Daily Reflection and or any of the literature loading please contact me through the contact button at the bottom of the homepage. Tell me the type of device you are on, if ALL of the following are working: Daily Reflections, Living Sober, 12 & 12, the pamphlets in the literature tab, the prayers, and the audio section. This can help me diagnose the problem since I can not replicate the issue on my end. Uninstalling and reinstalling the app may fix the issue, as long as you don't have any data (review/gratitude) entries that you need to keep.\n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
