{
    "updated":{"version": 35, "title": "Your app has been updated to the newest version!", "content":"Fixes include:\n-Emergency Just For Today Pamphlet Fix\n-Literature Error fixed\n\nIf you haven't already, please consider becoming a supporter by clicking the Support Us tab on the homescreen. I am currently working on the following upgrades, and your support allows me to dedicate the time needed!\n\n-Shareable nightly inventory\n-Big book search and possibly notes or highlight abilities\n-Ability to add favorites with the meeting list\n-And more!\nJust a note, these things take time to integrate, so be patient!\n\nI hope you have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 33, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'. This update includes a fix for the Doctor's Opinion audio, and added some literature. \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 17,"title":"Notification","content":"All,\nThe daily reflection for December 17 is causing issues on many devices. It is either redirecting to the website or causing crashes on some Android devices. This is due to a bug with the formatter which I am working to fix. Tomorrow's daily reflection appears to be good to go. If you haven't already please consider becoming a supporter by clicking on the support us tab on the home screen. Have a great sober holiday season! \n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
