{
    "updated":{"version": 53, "title": "Your app has been updated to the newest version!", "content":"The app has been updated! New features include:\n-Text that should be italic in the Big Book now is.\n-Audio now adds a bookmark to where you last listened to so you can pick up where you left off.\n-Bug fixes\n\nIf you haven't already, please consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 52, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update'.\n\nThis update adds new features including an audio bookmark and the proper italics in the big book plus important bug fixes.\n\nIf you haven't already, please consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature 😊", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 24,"title":"Notification","content":"All,\nThe meeting Finder appears to be temporarily down. There is no need to reach out to me to notify me. The meeting finder is run by the online intergroup of Alcoholics Anonymous, and I have notified them. It is up to them to resolve the issue, and I expect that it is to be resolved soon. Please check to see if it is working as this message may still be up for a little bit when the meeting finder goes back online. I plan to move to my own implementation of the meeting finder in the future, as these outages happen every once in a while. \n-Ben S","appleLink":"","androidLink":"", "dontDisplay": true}
}
