{
    "updated":{"version": 30, "title": "Your app has been updated to the newest version!", "content":"This update is an emergency fix for the daily reflections, GSO changed the page which broke the feature. I was able to immediately submit a fix to the app store for approval. Please consider becoming a supporter by clicking the support us button at the bottom of the home screen. Your support allows me to dedicate the substantial amount of time needed to maintain and update the app. You can also support the app by leaving a review in the app store. Have a great sober day!\n\n-Ben S.", "appleLink":"", "androidLink":""},
    "needsUpdate":{"version": 29, "title": "A new version is available!", "content":"Clicking the button below will take you to the app store where you can manually update the app by clicking 'update' This update includes a fix for the daily reflections which was broken because of an update on the official website. \n\nPlease consider becoming a supporter by clicking the support us tab at the bottom of the home screen. Your support means I am able to dedicate the time needed to maintain and update the app.\n\n PLEASE NOTE: the 'in app purchase' indicator is referencing the OPTION to contribute. The app is completely FREE to download and update, and is ALWAYS fully featured no matter your contributor status. It should only take a few seconds to update, then you can get back to the literature :)", "appleLink":"https://apps.apple.com/us/app/everything-aa/id1565768051", "androidLink":"https://play.google.com/store/apps/details?id=com.bigbook3"},
    "message":{"messageId": 5,"title":"Notification","content":"All,\nThanks for bearing with me! If your app updated and are still having problems, you can delete then re-install the app and everything should work fine. I'm looking to push another update that should make it so there are no issues requiring a re-install. Thanks for all of your support! \n-Ben S","appleLink":"","androidLink":"", "dontDisplay": false}
}
